#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_api_gateway_deployment.query_endpoints will be destroyed
  # (because aws_api_gateway_deployment.query_endpoints is not in configuration)
  - resource "aws_api_gateway_deployment" "query_endpoints" {
      - created_date  = "2025-11-21T15:04:54Z" -> null
      - execution_arn = "arn:aws:execute-api:us-east-2:855323747881:9fmuhcz4y0/" -> null
      - id            = "vd7184" -> null
      - invoke_url    = "https://9fmuhcz4y0.execute-api.us-east-2.amazonaws.com/" -> null
      - rest_api_id   = "9fmuhcz4y0" -> null
      - triggers      = {
          - "redeployment" = "2bc15af95edfa70fe79f9ae04f42ba9ef10369c4"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_integration.auth_callback will be destroyed
  # (because aws_api_gateway_integration.auth_callback is not in configuration)
  - resource "aws_api_gateway_integration" "auth_callback" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "1gz0dw" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "POST" -> null
      - id                      = "agi-9fmuhcz4y0-1gz0dw-POST" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "1gz0dw" -> null
      - rest_api_id             = "9fmuhcz4y0" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-query-runner-dev/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.auth_login_url will be destroyed
  # (because aws_api_gateway_integration.auth_login_url is not in configuration)
  - resource "aws_api_gateway_integration" "auth_login_url" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "byrik2" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-9fmuhcz4y0-byrik2-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "byrik2" -> null
      - rest_api_id             = "9fmuhcz4y0" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-query-runner-dev/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.auth_store_tokens will be destroyed
  # (because aws_api_gateway_integration.auth_store_tokens is not in configuration)
  - resource "aws_api_gateway_integration" "auth_store_tokens" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "s0h6g9" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "POST" -> null
      - id                      = "agi-9fmuhcz4y0-s0h6g9-POST" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "s0h6g9" -> null
      - rest_api_id             = "9fmuhcz4y0" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-query-runner-dev/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.runs_get will be destroyed
  # (because aws_api_gateway_integration.runs_get is not in configuration)
  - resource "aws_api_gateway_integration" "runs_get" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "i3olal" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-9fmuhcz4y0-i3olal-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "i3olal" -> null
      - rest_api_id             = "9fmuhcz4y0" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-query-runner-dev/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.runs_proxy will be destroyed
  # (because aws_api_gateway_integration.runs_proxy is not in configuration)
  - resource "aws_api_gateway_integration" "runs_proxy" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "vpv3td" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-9fmuhcz4y0-vpv3td-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "vpv3td" -> null
      - rest_api_id             = "9fmuhcz4y0" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-query-runner-dev/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.stats_proxy will be destroyed
  # (because aws_api_gateway_integration.stats_proxy is not in configuration)
  - resource "aws_api_gateway_integration" "stats_proxy" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "qv9zu1" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-9fmuhcz4y0-qv9zu1-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "qv9zu1" -> null
      - rest_api_id             = "9fmuhcz4y0" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-query-runner-dev/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.sync_user will be destroyed
  # (because aws_api_gateway_integration.sync_user is not in configuration)
  - resource "aws_api_gateway_integration" "sync_user" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "e9xd9h" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "POST" -> null
      - id                      = "agi-9fmuhcz4y0-e9xd9h-POST" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "e9xd9h" -> null
      - rest_api_id             = "9fmuhcz4y0" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-query-runner-dev/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_method.auth_callback_post will be destroyed
  # (because aws_api_gateway_method.auth_callback_post is not in configuration)
  - resource "aws_api_gateway_method" "auth_callback_post" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "POST" -> null
      - id                   = "agm-9fmuhcz4y0-1gz0dw-POST" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "1gz0dw" -> null
      - rest_api_id          = "9fmuhcz4y0" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_method.auth_login_url_get will be destroyed
  # (because aws_api_gateway_method.auth_login_url_get is not in configuration)
  - resource "aws_api_gateway_method" "auth_login_url_get" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-9fmuhcz4y0-byrik2-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "byrik2" -> null
      - rest_api_id          = "9fmuhcz4y0" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_method.auth_store_tokens_post will be destroyed
  # (because aws_api_gateway_method.auth_store_tokens_post is not in configuration)
  - resource "aws_api_gateway_method" "auth_store_tokens_post" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "POST" -> null
      - id                   = "agm-9fmuhcz4y0-s0h6g9-POST" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "s0h6g9" -> null
      - rest_api_id          = "9fmuhcz4y0" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_method.runs_get will be destroyed
  # (because aws_api_gateway_method.runs_get is not in configuration)
  - resource "aws_api_gateway_method" "runs_get" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-9fmuhcz4y0-i3olal-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "i3olal" -> null
      - rest_api_id          = "9fmuhcz4y0" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_method.runs_proxy_get will be destroyed
  # (because aws_api_gateway_method.runs_proxy_get is not in configuration)
  - resource "aws_api_gateway_method" "runs_proxy_get" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-9fmuhcz4y0-vpv3td-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "vpv3td" -> null
      - rest_api_id          = "9fmuhcz4y0" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_method.stats_proxy_get will be destroyed
  # (because aws_api_gateway_method.stats_proxy_get is not in configuration)
  - resource "aws_api_gateway_method" "stats_proxy_get" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-9fmuhcz4y0-qv9zu1-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "qv9zu1" -> null
      - rest_api_id          = "9fmuhcz4y0" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_method.sync_user_post will be destroyed
  # (because aws_api_gateway_method.sync_user_post is not in configuration)
  - resource "aws_api_gateway_method" "sync_user_post" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "POST" -> null
      - id                   = "agm-9fmuhcz4y0-e9xd9h-POST" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "e9xd9h" -> null
      - rest_api_id          = "9fmuhcz4y0" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_resource.auth will be destroyed
  # (because aws_api_gateway_resource.auth is not in configuration)
  - resource "aws_api_gateway_resource" "auth" {
      - id          = "fylrml" -> null
      - parent_id   = "9d31rhoech" -> null
      - path        = "/auth" -> null
      - path_part   = "auth" -> null
      - rest_api_id = "9fmuhcz4y0" -> null
    }

  # aws_api_gateway_resource.auth_callback will be destroyed
  # (because aws_api_gateway_resource.auth_callback is not in configuration)
  - resource "aws_api_gateway_resource" "auth_callback" {
      - id          = "1gz0dw" -> null
      - parent_id   = "fylrml" -> null
      - path        = "/auth/callback" -> null
      - path_part   = "callback" -> null
      - rest_api_id = "9fmuhcz4y0" -> null
    }

  # aws_api_gateway_resource.auth_login_url will be destroyed
  # (because aws_api_gateway_resource.auth_login_url is not in configuration)
  - resource "aws_api_gateway_resource" "auth_login_url" {
      - id          = "byrik2" -> null
      - parent_id   = "fylrml" -> null
      - path        = "/auth/login-url" -> null
      - path_part   = "login-url" -> null
      - rest_api_id = "9fmuhcz4y0" -> null
    }

  # aws_api_gateway_resource.auth_store_tokens will be destroyed
  # (because aws_api_gateway_resource.auth_store_tokens is not in configuration)
  - resource "aws_api_gateway_resource" "auth_store_tokens" {
      - id          = "s0h6g9" -> null
      - parent_id   = "fylrml" -> null
      - path        = "/auth/store-tokens" -> null
      - path_part   = "store-tokens" -> null
      - rest_api_id = "9fmuhcz4y0" -> null
    }

  # aws_api_gateway_resource.runs will be destroyed
  # (because aws_api_gateway_resource.runs is not in configuration)
  - resource "aws_api_gateway_resource" "runs" {
      - id          = "i3olal" -> null
      - parent_id   = "9d31rhoech" -> null
      - path        = "/runs" -> null
      - path_part   = "runs" -> null
      - rest_api_id = "9fmuhcz4y0" -> null
    }

  # aws_api_gateway_resource.runs_proxy will be destroyed
  # (because aws_api_gateway_resource.runs_proxy is not in configuration)
  - resource "aws_api_gateway_resource" "runs_proxy" {
      - id          = "vpv3td" -> null
      - parent_id   = "i3olal" -> null
      - path        = "/runs/{proxy+}" -> null
      - path_part   = "{proxy+}" -> null
      - rest_api_id = "9fmuhcz4y0" -> null
    }

  # aws_api_gateway_resource.stats will be destroyed
  # (because aws_api_gateway_resource.stats is not in configuration)
  - resource "aws_api_gateway_resource" "stats" {
      - id          = "vbt965" -> null
      - parent_id   = "9d31rhoech" -> null
      - path        = "/stats" -> null
      - path_part   = "stats" -> null
      - rest_api_id = "9fmuhcz4y0" -> null
    }

  # aws_api_gateway_resource.stats_proxy will be destroyed
  # (because aws_api_gateway_resource.stats_proxy is not in configuration)
  - resource "aws_api_gateway_resource" "stats_proxy" {
      - id          = "qv9zu1" -> null
      - parent_id   = "vbt965" -> null
      - path        = "/stats/{proxy+}" -> null
      - path_part   = "{proxy+}" -> null
      - rest_api_id = "9fmuhcz4y0" -> null
    }

  # aws_api_gateway_resource.sync_user will be destroyed
  # (because aws_api_gateway_resource.sync_user is not in configuration)
  - resource "aws_api_gateway_resource" "sync_user" {
      - id          = "e9xd9h" -> null
      - parent_id   = "9d31rhoech" -> null
      - path        = "/sync-user" -> null
      - path_part   = "sync-user" -> null
      - rest_api_id = "9fmuhcz4y0" -> null
    }

  # aws_lambda_permission.api_gateway_invoke will be destroyed
  # (because aws_lambda_permission.api_gateway_invoke is not in configuration)
  - resource "aws_lambda_permission" "api_gateway_invoke" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "myrunstreak-sync-runner-dev" -> null
      - id                  = "AllowAPIGatewayInvoke" -> null
      - principal           = "apigateway.amazonaws.com" -> null
      - source_arn          = "arn:aws:execute-api:us-east-2:855323747881:9fmuhcz4y0/*/*" -> null
      - statement_id        = "AllowAPIGatewayInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_permission.query_api_gateway_invoke will be destroyed
  # (because aws_lambda_permission.query_api_gateway_invoke is not in configuration)
  - resource "aws_lambda_permission" "query_api_gateway_invoke" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "myrunstreak-query-runner-dev" -> null
      - id                  = "AllowAPIGatewayInvokeQuery" -> null
      - principal           = "apigateway.amazonaws.com" -> null
      - source_arn          = "arn:aws:execute-api:us-east-2:855323747881:9fmuhcz4y0/*/*" -> null
      - statement_id        = "AllowAPIGatewayInvokeQuery" -> null
        # (2 unchanged attributes hidden)
    }

  # null_resource.update_stage_deployment will be destroyed
  # (because null_resource.update_stage_deployment is not in configuration)
  - resource "null_resource" "update_stage_deployment" {
      - id       = "8524347779669094406" -> null
      - triggers = {
          - "deployment_id" = "vd7184"
        } -> null
    }

  # module.api_gateway.aws_api_gateway_account.main will be destroyed
  # (because aws_api_gateway_account.main is not in configuration)
  - resource "aws_api_gateway_account" "main" {
      - api_key_version     = "4" -> null
      - cloudwatch_role_arn = "arn:aws:iam::855323747881:role/runstreak-api-gateway-cloudwatch-dev" -> null
      - features            = [
          - "UsagePlans",
        ] -> null
      - id                  = "api-gateway-account" -> null
      - throttle_settings   = [
          - {
              - burst_limit = 5000
              - rate_limit  = 10000
            },
        ] -> null
    }

  # module.api_gateway.aws_api_gateway_api_key.personal will be destroyed
  # (because aws_api_gateway_api_key.personal is not in configuration)
  - resource "aws_api_gateway_api_key" "personal" {
      - arn               = "arn:aws:apigateway:us-east-2::/apikeys/b271015yqe" -> null
      - created_date      = "2025-10-31T19:37:03Z" -> null
      - description       = "Personal API key for MyRunStreak.com" -> null
      - enabled           = true -> null
      - id                = "b271015yqe" -> null
      - last_updated_date = "2025-10-31T19:37:03Z" -> null
      - name              = "myrunstreak-personal-dev" -> null
      - tags              = {
          - "Environment" = "dev"
          - "Project"     = "MyRunStreak"
        } -> null
      - tags_all          = {
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Project"     = "MyRunStreak"
        } -> null
      - value             = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # module.api_gateway.aws_api_gateway_deployment.main will be destroyed
  # (because aws_api_gateway_deployment.main is not in configuration)
  - resource "aws_api_gateway_deployment" "main" {
      - created_date  = "2025-10-31T19:37:04Z" -> null
      - execution_arn = "arn:aws:execute-api:us-east-2:855323747881:9fmuhcz4y0/" -> null
      - id            = "oc9zeu" -> null
      - invoke_url    = "https://9fmuhcz4y0.execute-api.us-east-2.amazonaws.com/" -> null
      - rest_api_id   = "9fmuhcz4y0" -> null
      - triggers      = {
          - "redeployment" = "e3512eee7a251a8d18b4e7b2c5b790bcd4728ec7"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.api_gateway.aws_api_gateway_integration.health_mock will be destroyed
  # (because aws_api_gateway_integration.health_mock is not in configuration)
  - resource "aws_api_gateway_integration" "health_mock" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "c094e6" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-9fmuhcz4y0-c094e6-GET" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = jsonencode(
                {
                  - statusCode = 200
                }
            )
        } -> null
      - resource_id             = "c094e6" -> null
      - rest_api_id             = "9fmuhcz4y0" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "MOCK" -> null
        # (5 unchanged attributes hidden)
    }

  # module.api_gateway.aws_api_gateway_integration.sync_lambda will be destroyed
  # (because aws_api_gateway_integration.sync_lambda is not in configuration)
  - resource "aws_api_gateway_integration" "sync_lambda" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "cof5zn" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "POST" -> null
      - id                      = "agi-9fmuhcz4y0-cof5zn-POST" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "cof5zn" -> null
      - rest_api_id             = "9fmuhcz4y0" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-sync-runner-dev/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.api_gateway.aws_api_gateway_integration.sync_options will be destroyed
  # (because aws_api_gateway_integration.sync_options is not in configuration)
  - resource "aws_api_gateway_integration" "sync_options" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "cof5zn" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "OPTIONS" -> null
      - id                      = "agi-9fmuhcz4y0-cof5zn-OPTIONS" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = jsonencode(
                {
                  - statusCode = 200
                }
            )
        } -> null
      - resource_id             = "cof5zn" -> null
      - rest_api_id             = "9fmuhcz4y0" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "MOCK" -> null
        # (5 unchanged attributes hidden)
    }

  # module.api_gateway.aws_api_gateway_integration_response.health_mock will be destroyed
  # (because aws_api_gateway_integration_response.health_mock is not in configuration)
  - resource "aws_api_gateway_integration_response" "health_mock" {
      - http_method         = "GET" -> null
      - id                  = "agir-9fmuhcz4y0-c094e6-GET-200" -> null
      - resource_id         = "c094e6" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = jsonencode(
                {
                  - environment = "dev"
                  - service     = "myrunstreak-api"
                  - status      = "healthy"
                  - timestamp   = "$context.requestTime"
                }
            )
        } -> null
      - rest_api_id         = "9fmuhcz4y0" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.api_gateway.aws_api_gateway_integration_response.sync_lambda will be destroyed
  # (because aws_api_gateway_integration_response.sync_lambda is not in configuration)
  - resource "aws_api_gateway_integration_response" "sync_lambda" {
      - http_method         = "POST" -> null
      - id                  = "agir-9fmuhcz4y0-cof5zn-POST-200" -> null
      - resource_id         = "cof5zn" -> null
      - response_parameters = {} -> null
      - response_templates  = {} -> null
      - rest_api_id         = "9fmuhcz4y0" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.api_gateway.aws_api_gateway_integration_response.sync_options will be destroyed
  # (because aws_api_gateway_integration_response.sync_options is not in configuration)
  - resource "aws_api_gateway_integration_response" "sync_options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agir-9fmuhcz4y0-cof5zn-OPTIONS-200" -> null
      - resource_id         = "cof5zn" -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          - "method.response.header.Access-Control-Allow-Methods" = "'POST,OPTIONS'"
          - "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        } -> null
      - response_templates  = {} -> null
      - rest_api_id         = "9fmuhcz4y0" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.api_gateway.aws_api_gateway_method.health_get will be destroyed
  # (because aws_api_gateway_method.health_get is not in configuration)
  - resource "aws_api_gateway_method" "health_get" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-9fmuhcz4y0-c094e6-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "c094e6" -> null
      - rest_api_id          = "9fmuhcz4y0" -> null
        # (3 unchanged attributes hidden)
    }

  # module.api_gateway.aws_api_gateway_method.sync_options will be destroyed
  # (because aws_api_gateway_method.sync_options is not in configuration)
  - resource "aws_api_gateway_method" "sync_options" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agm-9fmuhcz4y0-cof5zn-OPTIONS" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "cof5zn" -> null
      - rest_api_id          = "9fmuhcz4y0" -> null
        # (3 unchanged attributes hidden)
    }

  # module.api_gateway.aws_api_gateway_method.sync_post will be destroyed
  # (because aws_api_gateway_method.sync_post is not in configuration)
  - resource "aws_api_gateway_method" "sync_post" {
      - api_key_required     = true -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "POST" -> null
      - id                   = "agm-9fmuhcz4y0-cof5zn-POST" -> null
      - request_models       = {} -> null
      - request_parameters   = {
          - "method.request.header.x-api-key" = true
        } -> null
      - resource_id          = "cof5zn" -> null
      - rest_api_id          = "9fmuhcz4y0" -> null
        # (3 unchanged attributes hidden)
    }

  # module.api_gateway.aws_api_gateway_method_response.health_get_200 will be destroyed
  # (because aws_api_gateway_method_response.health_get_200 is not in configuration)
  - resource "aws_api_gateway_method_response" "health_get_200" {
      - http_method         = "GET" -> null
      - id                  = "agmr-9fmuhcz4y0-c094e6-GET-200" -> null
      - resource_id         = "c094e6" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {} -> null
      - rest_api_id         = "9fmuhcz4y0" -> null
      - status_code         = "200" -> null
    }

  # module.api_gateway.aws_api_gateway_method_response.sync_options_200 will be destroyed
  # (because aws_api_gateway_method_response.sync_options_200 is not in configuration)
  - resource "aws_api_gateway_method_response" "sync_options_200" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agmr-9fmuhcz4y0-cof5zn-OPTIONS-200" -> null
      - resource_id         = "cof5zn" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = true
          - "method.response.header.Access-Control-Allow-Methods" = true
          - "method.response.header.Access-Control-Allow-Origin"  = true
        } -> null
      - rest_api_id         = "9fmuhcz4y0" -> null
      - status_code         = "200" -> null
    }

  # module.api_gateway.aws_api_gateway_method_response.sync_post_200 will be destroyed
  # (because aws_api_gateway_method_response.sync_post_200 is not in configuration)
  - resource "aws_api_gateway_method_response" "sync_post_200" {
      - http_method         = "POST" -> null
      - id                  = "agmr-9fmuhcz4y0-cof5zn-POST-200" -> null
      - resource_id         = "cof5zn" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "9fmuhcz4y0" -> null
      - status_code         = "200" -> null
    }

  # module.api_gateway.aws_api_gateway_method_settings.main will be destroyed
  # (because aws_api_gateway_method_settings.main is not in configuration)
  - resource "aws_api_gateway_method_settings" "main" {
      - id          = "9fmuhcz4y0-dev-*/*" -> null
      - method_path = "*/*" -> null
      - rest_api_id = "9fmuhcz4y0" -> null
      - stage_name  = "dev" -> null

      - settings {
          - cache_data_encrypted                       = false -> null
          - cache_ttl_in_seconds                       = 300 -> null
          - caching_enabled                            = false -> null
          - data_trace_enabled                         = true -> null
          - logging_level                              = "INFO" -> null
          - metrics_enabled                            = true -> null
          - require_authorization_for_cache_control    = true -> null
          - throttling_burst_limit                     = 10 -> null
          - throttling_rate_limit                      = 5 -> null
          - unauthorized_cache_control_header_strategy = "SUCCEED_WITH_RESPONSE_HEADER" -> null
        }
    }

  # module.api_gateway.aws_api_gateway_resource.health will be destroyed
  # (because aws_api_gateway_resource.health is not in configuration)
  - resource "aws_api_gateway_resource" "health" {
      - id          = "c094e6" -> null
      - parent_id   = "9d31rhoech" -> null
      - path        = "/health" -> null
      - path_part   = "health" -> null
      - rest_api_id = "9fmuhcz4y0" -> null
    }

  # module.api_gateway.aws_api_gateway_resource.sync will be destroyed
  # (because aws_api_gateway_resource.sync is not in configuration)
  - resource "aws_api_gateway_resource" "sync" {
      - id          = "cof5zn" -> null
      - parent_id   = "9d31rhoech" -> null
      - path        = "/sync" -> null
      - path_part   = "sync" -> null
      - rest_api_id = "9fmuhcz4y0" -> null
    }

  # module.api_gateway.aws_api_gateway_rest_api.main will be destroyed
  # (because aws_api_gateway_rest_api.main is not in configuration)
  - resource "aws_api_gateway_rest_api" "main" {
      - api_key_source               = "HEADER" -> null
      - arn                          = "arn:aws:apigateway:us-east-2::/restapis/9fmuhcz4y0" -> null
      - binary_media_types           = [] -> null
      - created_date                 = "2025-10-31T19:37:03Z" -> null
      - description                  = "MyRunStreak.com API for syncing running data and retrieving stats" -> null
      - disable_execute_api_endpoint = false -> null
      - execution_arn                = "arn:aws:execute-api:us-east-2:855323747881:9fmuhcz4y0" -> null
      - id                           = "9fmuhcz4y0" -> null
      - minimum_compression_size     = "1024" -> null
      - name                         = "myrunstreak-api-dev" -> null
      - root_resource_id             = "9d31rhoech" -> null
      - tags                         = {
          - "Environment" = "dev"
          - "Name"        = "myrunstreak-api"
          - "Project"     = "MyRunStreak"
        } -> null
      - tags_all                     = {
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Name"        = "myrunstreak-api"
          - "Project"     = "MyRunStreak"
        } -> null
        # (1 unchanged attribute hidden)

      - endpoint_configuration {
          - ip_address_type  = "ipv4" -> null
          - types            = [
              - "EDGE",
            ] -> null
          - vpc_endpoint_ids = [] -> null
        }
    }

  # module.api_gateway.aws_api_gateway_stage.main will be destroyed
  # (because aws_api_gateway_stage.main is not in configuration)
  - resource "aws_api_gateway_stage" "main" {
      - arn                   = "arn:aws:apigateway:us-east-2::/restapis/9fmuhcz4y0/stages/dev" -> null
      - cache_cluster_enabled = false -> null
      - deployment_id         = "oc9zeu" -> null
      - execution_arn         = "arn:aws:execute-api:us-east-2:855323747881:9fmuhcz4y0/dev" -> null
      - id                    = "ags-9fmuhcz4y0-dev" -> null
      - invoke_url            = "https://9fmuhcz4y0.execute-api.us-east-2.amazonaws.com/dev" -> null
      - rest_api_id           = "9fmuhcz4y0" -> null
      - stage_name            = "dev" -> null
      - tags                  = {
          - "Environment" = "dev"
          - "Project"     = "MyRunStreak"
        } -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Project"     = "MyRunStreak"
        } -> null
      - variables             = {} -> null
      - xray_tracing_enabled  = false -> null
        # (5 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-east-2:855323747881:log-group:/aws/apigateway/myrunstreak-dev" -> null
          - format          = jsonencode(
                {
                  - caller         = "$context.identity.caller"
                  - httpMethod     = "$context.httpMethod"
                  - ip             = "$context.identity.sourceIp"
                  - protocol       = "$context.protocol"
                  - requestId      = "$context.requestId"
                  - requestTime    = "$context.requestTime"
                  - resourcePath   = "$context.resourcePath"
                  - responseLength = "$context.responseLength"
                  - status         = "$context.status"
                  - user           = "$context.identity.user"
                }
            ) -> null
        }
    }

  # module.api_gateway.aws_api_gateway_usage_plan.main will be destroyed
  # (because aws_api_gateway_usage_plan.main is not in configuration)
  - resource "aws_api_gateway_usage_plan" "main" {
      - arn          = "arn:aws:apigateway:us-east-2::/usageplans/o7093g" -> null
      - description  = "Usage plan for MyRunStreak.com API" -> null
      - id           = "o7093g" -> null
      - name         = "myrunstreak-usage-plan-dev" -> null
      - tags         = {
          - "Environment" = "dev"
          - "Project"     = "MyRunStreak"
        } -> null
      - tags_all     = {
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Project"     = "MyRunStreak"
        } -> null
        # (1 unchanged attribute hidden)

      - api_stages {
          - api_id = "9fmuhcz4y0" -> null
          - stage  = "dev" -> null
        }

      - quota_settings {
          - limit  = 1000 -> null
          - offset = 0 -> null
          - period = "DAY" -> null
        }

      - throttle_settings {
          - burst_limit = 10 -> null
          - rate_limit  = 5 -> null
        }
    }

  # module.api_gateway.aws_api_gateway_usage_plan_key.main will be destroyed
  # (because aws_api_gateway_usage_plan_key.main is not in configuration)
  - resource "aws_api_gateway_usage_plan_key" "main" {
      - id            = "b271015yqe" -> null
      - key_id        = "b271015yqe" -> null
      - key_type      = "API_KEY" -> null
      - name          = "myrunstreak-personal-dev" -> null
      - usage_plan_id = "o7093g" -> null
      - value         = "Ia5R5qgYyv76dRg9ZL16W8cBUq5aOw1urrtYS0fi" -> null
    }

  # module.api_gateway.aws_cloudwatch_log_group.api_gateway will be destroyed
  # (because aws_cloudwatch_log_group.api_gateway is not in configuration)
  - resource "aws_cloudwatch_log_group" "api_gateway" {
      - arn               = "arn:aws:logs:us-east-2:855323747881:log-group:/aws/apigateway/myrunstreak-dev" -> null
      - id                = "/aws/apigateway/myrunstreak-dev" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/apigateway/myrunstreak-dev" -> null
      - retention_in_days = 14 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "dev"
          - "Project"     = "MyRunStreak"
        } -> null
      - tags_all          = {
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Project"     = "MyRunStreak"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.api_gateway.aws_cloudwatch_metric_alarm.api_4xx_errors[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.api_4xx_errors is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "api_4xx_errors" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [] -> null
      - alarm_description                     = "API Gateway is returning 4XX errors" -> null
      - alarm_name                            = "myrunstreak-api-4xx-errors-dev" -> null
      - arn                                   = "arn:aws:cloudwatch:us-east-2:855323747881:alarm:myrunstreak-api-4xx-errors-dev" -> null
      - comparison_operator                   = "GreaterThanThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {
          - "ApiName" = "myrunstreak-api-dev"
          - "Stage"   = "dev"
        } -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "myrunstreak-api-4xx-errors-dev" -> null
      - insufficient_data_actions             = [] -> null
      - metric_name                           = "4XXError" -> null
      - namespace                             = "AWS/ApiGateway" -> null
      - ok_actions                            = [] -> null
      - period                                = 300 -> null
      - statistic                             = "Sum" -> null
      - tags                                  = {} -> null
      - tags_all                              = {
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Project"     = "MyRunStreak"
        } -> null
      - threshold                             = 10 -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (4 unchanged attributes hidden)
    }

  # module.api_gateway.aws_cloudwatch_metric_alarm.api_5xx_errors[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.api_5xx_errors is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "api_5xx_errors" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [] -> null
      - alarm_description                     = "API Gateway is returning 5XX errors" -> null
      - alarm_name                            = "myrunstreak-api-5xx-errors-dev" -> null
      - arn                                   = "arn:aws:cloudwatch:us-east-2:855323747881:alarm:myrunstreak-api-5xx-errors-dev" -> null
      - comparison_operator                   = "GreaterThanThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {
          - "ApiName" = "myrunstreak-api-dev"
          - "Stage"   = "dev"
        } -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "myrunstreak-api-5xx-errors-dev" -> null
      - insufficient_data_actions             = [] -> null
      - metric_name                           = "5XXError" -> null
      - namespace                             = "AWS/ApiGateway" -> null
      - ok_actions                            = [] -> null
      - period                                = 300 -> null
      - statistic                             = "Sum" -> null
      - tags                                  = {} -> null
      - tags_all                              = {
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Project"     = "MyRunStreak"
        } -> null
      - threshold                             = 5 -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (4 unchanged attributes hidden)
    }

  # module.api_gateway.aws_cloudwatch_metric_alarm.api_latency[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.api_latency is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "api_latency" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [] -> null
      - alarm_description                     = "API Gateway latency is high" -> null
      - alarm_name                            = "myrunstreak-api-latency-dev" -> null
      - arn                                   = "arn:aws:cloudwatch:us-east-2:855323747881:alarm:myrunstreak-api-latency-dev" -> null
      - comparison_operator                   = "GreaterThanThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {
          - "ApiName" = "myrunstreak-api-dev"
          - "Stage"   = "dev"
        } -> null
      - evaluation_periods                    = 2 -> null
      - id                                    = "myrunstreak-api-latency-dev" -> null
      - insufficient_data_actions             = [] -> null
      - metric_name                           = "Latency" -> null
      - namespace                             = "AWS/ApiGateway" -> null
      - ok_actions                            = [] -> null
      - period                                = 300 -> null
      - statistic                             = "Average" -> null
      - tags                                  = {} -> null
      - tags_all                              = {
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Project"     = "MyRunStreak"
        } -> null
      - threshold                             = 5000 -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (4 unchanged attributes hidden)
    }

  # module.api_gateway.aws_iam_role.api_gateway_cloudwatch will be destroyed
  # (because aws_iam_role.api_gateway_cloudwatch is not in configuration)
  - resource "aws_iam_role" "api_gateway_cloudwatch" {
      - arn                   = "arn:aws:iam::855323747881:role/myrunstreak-api-gateway-cloudwatch-dev" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "apigateway.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-10-31T19:37:03Z" -> null
      - force_detach_policies = false -> null
      - id                    = "myrunstreak-api-gateway-cloudwatch-dev" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "myrunstreak-api-gateway-cloudwatch-dev" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "dev"
          - "Project"     = "MyRunStreak"
        } -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Project"     = "MyRunStreak"
        } -> null
      - unique_id             = "AROA4OJKEUYUX7Q46P72Z" -> null
        # (3 unchanged attributes hidden)
    }

  # module.api_gateway.aws_iam_role_policy_attachment.api_gateway_cloudwatch will be destroyed
  # (because aws_iam_role_policy_attachment.api_gateway_cloudwatch is not in configuration)
  - resource "aws_iam_role_policy_attachment" "api_gateway_cloudwatch" {
      - id         = "myrunstreak-api-gateway-cloudwatch-dev-20251031193703407400000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs" -> null
      - role       = "myrunstreak-api-gateway-cloudwatch-dev" -> null
    }

  # module.api_gateway_consumer.data.aws_ssm_parameter.api_gateway_execution_arn will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "api_gateway_execution_arn" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + name           = "/runstreak/shared/dev/api-gateway-execution-arn"
      + type           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.api_gateway_consumer.data.aws_ssm_parameter.api_gateway_id will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "api_gateway_id" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + name           = "/runstreak/shared/dev/api-gateway-id"
      + type           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.api_gateway_consumer.data.aws_ssm_parameter.api_gateway_invoke_url will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "api_gateway_invoke_url" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + name           = "/runstreak/shared/dev/api-gateway-invoke-url"
      + type           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.api_gateway_consumer.data.aws_ssm_parameter.api_gateway_root_resource_id will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "api_gateway_root_resource_id" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + name           = "/runstreak/shared/dev/api-gateway-root-resource-id"
      + type           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.api_gateway_consumer.data.aws_ssm_parameter.api_gateway_stage_name will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "api_gateway_stage_name" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + name           = "/runstreak/shared/dev/api-gateway-stage-name"
      + type           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.api_gateway_consumer.aws_api_gateway_deployment.myrunstreak will be created
  + resource "aws_api_gateway_deployment" "myrunstreak" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (sensitive value)
      + triggers      = (known after apply)
    }

  # module.api_gateway_consumer.aws_api_gateway_integration.auth_callback will be created
  + resource "aws_api_gateway_integration" "auth_callback" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (sensitive value)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-query-runner-dev/invocations"
    }

  # module.api_gateway_consumer.aws_api_gateway_integration.auth_login_url will be created
  + resource "aws_api_gateway_integration" "auth_login_url" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (sensitive value)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-query-runner-dev/invocations"
    }

  # module.api_gateway_consumer.aws_api_gateway_integration.auth_store_tokens will be created
  + resource "aws_api_gateway_integration" "auth_store_tokens" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (sensitive value)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-query-runner-dev/invocations"
    }

  # module.api_gateway_consumer.aws_api_gateway_integration.runs_get will be created
  + resource "aws_api_gateway_integration" "runs_get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (sensitive value)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-query-runner-dev/invocations"
    }

  # module.api_gateway_consumer.aws_api_gateway_integration.runs_proxy will be created
  + resource "aws_api_gateway_integration" "runs_proxy" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (sensitive value)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-query-runner-dev/invocations"
    }

  # module.api_gateway_consumer.aws_api_gateway_integration.stats_proxy will be created
  + resource "aws_api_gateway_integration" "stats_proxy" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (sensitive value)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-query-runner-dev/invocations"
    }

  # module.api_gateway_consumer.aws_api_gateway_integration.sync_lambda will be created
  + resource "aws_api_gateway_integration" "sync_lambda" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (sensitive value)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-sync-runner-dev/invocations"
    }

  # module.api_gateway_consumer.aws_api_gateway_integration.sync_options will be created
  + resource "aws_api_gateway_integration" "sync_options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (sensitive value)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.api_gateway_consumer.aws_api_gateway_integration.sync_user will be created
  + resource "aws_api_gateway_integration" "sync_user" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (sensitive value)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-query-runner-dev/invocations"
    }

  # module.api_gateway_consumer.aws_api_gateway_integration_response.sync_lambda will be created
  + resource "aws_api_gateway_integration_response" "sync_lambda" {
      + http_method = "POST"
      + id          = (known after apply)
      + resource_id = (known after apply)
      + rest_api_id = (sensitive value)
      + status_code = "200"
    }

  # module.api_gateway_consumer.aws_api_gateway_integration_response.sync_options will be created
  + resource "aws_api_gateway_integration_response" "sync_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'POST,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = (sensitive value)
      + status_code         = "200"
    }

  # module.api_gateway_consumer.aws_api_gateway_method.auth_callback_post will be created
  + resource "aws_api_gateway_method" "auth_callback_post" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (sensitive value)
    }

  # module.api_gateway_consumer.aws_api_gateway_method.auth_login_url_get will be created
  + resource "aws_api_gateway_method" "auth_login_url_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (sensitive value)
    }

  # module.api_gateway_consumer.aws_api_gateway_method.auth_store_tokens_post will be created
  + resource "aws_api_gateway_method" "auth_store_tokens_post" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (sensitive value)
    }

  # module.api_gateway_consumer.aws_api_gateway_method.runs_get will be created
  + resource "aws_api_gateway_method" "runs_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (sensitive value)
    }

  # module.api_gateway_consumer.aws_api_gateway_method.runs_proxy_get will be created
  + resource "aws_api_gateway_method" "runs_proxy_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (sensitive value)
    }

  # module.api_gateway_consumer.aws_api_gateway_method.stats_proxy_get will be created
  + resource "aws_api_gateway_method" "stats_proxy_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (sensitive value)
    }

  # module.api_gateway_consumer.aws_api_gateway_method.sync_options will be created
  + resource "aws_api_gateway_method" "sync_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (sensitive value)
    }

  # module.api_gateway_consumer.aws_api_gateway_method.sync_post will be created
  + resource "aws_api_gateway_method" "sync_post" {
      + api_key_required   = true
      + authorization      = "NONE"
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.header.x-api-key" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (sensitive value)
    }

  # module.api_gateway_consumer.aws_api_gateway_method.sync_user_post will be created
  + resource "aws_api_gateway_method" "sync_user_post" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (sensitive value)
    }

  # module.api_gateway_consumer.aws_api_gateway_method_response.sync_options_200 will be created
  + resource "aws_api_gateway_method_response" "sync_options_200" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (sensitive value)
      + status_code         = "200"
    }

  # module.api_gateway_consumer.aws_api_gateway_method_response.sync_post_200 will be created
  + resource "aws_api_gateway_method_response" "sync_post_200" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (sensitive value)
      + status_code         = "200"
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.auth will be created
  + resource "aws_api_gateway_resource" "auth" {
      + id          = (known after apply)
      + parent_id   = (sensitive value)
      + path        = (known after apply)
      + path_part   = "auth"
      + rest_api_id = (sensitive value)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.auth_callback will be created
  + resource "aws_api_gateway_resource" "auth_callback" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "callback"
      + rest_api_id = (sensitive value)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.auth_login_url will be created
  + resource "aws_api_gateway_resource" "auth_login_url" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "login-url"
      + rest_api_id = (sensitive value)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.auth_store_tokens will be created
  + resource "aws_api_gateway_resource" "auth_store_tokens" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "store-tokens"
      + rest_api_id = (sensitive value)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.runs will be created
  + resource "aws_api_gateway_resource" "runs" {
      + id          = (known after apply)
      + parent_id   = (sensitive value)
      + path        = (known after apply)
      + path_part   = "runs"
      + rest_api_id = (sensitive value)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.runs_proxy will be created
  + resource "aws_api_gateway_resource" "runs_proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = (sensitive value)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.stats will be created
  + resource "aws_api_gateway_resource" "stats" {
      + id          = (known after apply)
      + parent_id   = (sensitive value)
      + path        = (known after apply)
      + path_part   = "stats"
      + rest_api_id = (sensitive value)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.stats_proxy will be created
  + resource "aws_api_gateway_resource" "stats_proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = (sensitive value)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.sync will be created
  + resource "aws_api_gateway_resource" "sync" {
      + id          = (known after apply)
      + parent_id   = (sensitive value)
      + path        = (known after apply)
      + path_part   = "sync"
      + rest_api_id = (sensitive value)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.sync_user will be created
  + resource "aws_api_gateway_resource" "sync_user" {
      + id          = (known after apply)
      + parent_id   = (sensitive value)
      + path        = (known after apply)
      + path_part   = "sync-user"
      + rest_api_id = (sensitive value)
    }

  # module.api_gateway_consumer.aws_lambda_permission.query_lambda_api_gateway will be created
  + resource "aws_lambda_permission" "query_lambda_api_gateway" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "myrunstreak-query-runner-dev"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (sensitive value)
      + statement_id        = "AllowAPIGatewayInvoke-dev"
      + statement_id_prefix = (known after apply)
    }

  # module.api_gateway_consumer.aws_lambda_permission.sync_lambda_api_gateway will be created
  + resource "aws_lambda_permission" "sync_lambda_api_gateway" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "myrunstreak-sync-runner-dev"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (sensitive value)
      + statement_id        = "AllowAPIGatewayInvoke-dev"
      + statement_id_prefix = (known after apply)
    }

  # module.api_gateway_consumer.null_resource.update_stage_deployment will be created
  + resource "null_resource" "update_stage_deployment" {
      + id       = (known after apply)
      + triggers = {
          + "deployment_id" = (known after apply)
        }
    }

  # module.lambda.aws_lambda_function.sync_runner will be updated in-place
  ~ resource "aws_lambda_function" "sync_runner" {
      ~ description                    = "Syncs running data - updated $(date +%s)" -> "Syncs running data from SmashRun API to DuckDB database"
        id                             = "myrunstreak-sync-runner-dev"
      ~ image_uri                      = "855323747881.dkr.ecr.us-east-2.amazonaws.com/myrunstreak-sync-dev:86da257c32acda33f561f9dc88650e376f811e46" -> "855323747881.dkr.ecr.us-east-2.amazonaws.com/myrunstreak-sync-dev:latest"
      ~ last_modified                  = "2025-12-02T18:51:38.000+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "Name"        = "myrunstreak-sync-runner-dev"
            "Project"     = "MyRunStreak"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GRAFANA_OTEL_SECRET_NAME"    = "myrunstreak/dev/grafana/otel" -> null
              - "OTEL_ENABLED"                = "true" -> null
              - "OTEL_EXPORTER_OTLP_PROTOCOL" = "http/protobuf" -> null
              - "OTEL_LOGS_EXPORTER"          = "none" -> null
              - "OTEL_METRICS_EXPORTER"       = "none" -> null
              - "OTEL_PROPAGATORS"            = "tracecontext,baggage" -> null
              - "OTEL_SERVICE_NAME"           = "myrunstreak-sync-runner" -> null
              - "OTEL_TRACES_EXPORTER"        = "otlp" -> null
                # (7 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_publish_status.aws_lambda_function.sync_runner will be updated in-place
  ~ resource "aws_lambda_function" "sync_runner" {
        id                             = "myrunstreak-publish-status-dev"
      ~ image_uri                      = "855323747881.dkr.ecr.us-east-2.amazonaws.com/myrunstreak-publish-status-dev:86da257c32acda33f561f9dc88650e376f811e46" -> "855323747881.dkr.ecr.us-east-2.amazonaws.com/myrunstreak-publish-status-dev:latest"
      ~ last_modified                  = "2025-12-02T18:51:36.000+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "Name"        = "myrunstreak-publish-status-dev"
            "Project"     = "MyRunStreak"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GRAFANA_OTEL_SECRET_NAME"    = "myrunstreak/dev/grafana/otel" -> null
              - "OTEL_ENABLED"                = "true" -> null
              - "OTEL_EXPORTER_OTLP_PROTOCOL" = "http/protobuf" -> null
              - "OTEL_LOGS_EXPORTER"          = "none" -> null
              - "OTEL_METRICS_EXPORTER"       = "none" -> null
              - "OTEL_PROPAGATORS"            = "tracecontext,baggage" -> null
              - "OTEL_SERVICE_NAME"           = "myrunstreak-publish-status" -> null
              - "OTEL_TRACES_EXPORTER"        = "otlp" -> null
                # (6 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_query.aws_lambda_function.sync_runner will be updated in-place
  ~ resource "aws_lambda_function" "sync_runner" {
        id                             = "myrunstreak-query-runner-dev"
      ~ image_uri                      = "855323747881.dkr.ecr.us-east-2.amazonaws.com/myrunstreak-query-dev:86da257c32acda33f561f9dc88650e376f811e46" -> "855323747881.dkr.ecr.us-east-2.amazonaws.com/myrunstreak-query-dev:latest"
      ~ last_modified                  = "2025-12-02T18:51:45.000+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "Name"        = "myrunstreak-query-runner-dev"
            "Project"     = "MyRunStreak"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GRAFANA_OTEL_SECRET_NAME"     = "myrunstreak/dev/grafana/otel" -> null
              - "OTEL_ENABLED"                 = "true" -> null
              - "OTEL_EXPORTER_OTLP_PROTOCOL"  = "http/protobuf" -> null
              - "OTEL_LOGS_EXPORTER"           = "none" -> null
              - "OTEL_METRICS_EXPORTER"        = "none" -> null
              - "OTEL_PROPAGATORS"             = "tracecontext,baggage" -> null
              - "OTEL_SERVICE_NAME"            = "myrunstreak-query-runner" -> null
              - "OTEL_TRACES_EXPORTER"         = "otlp" -> null
                # (6 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.secrets.aws_secretsmanager_secret.grafana_otel[0] will be destroyed
  # (because aws_secretsmanager_secret.grafana_otel is not in configuration)
  - resource "aws_secretsmanager_secret" "grafana_otel" {
      - arn                            = "arn:aws:secretsmanager:us-east-2:855323747881:secret:myrunstreak/dev/grafana/otel-2DaeO1" -> null
      - description                    = "Grafana Cloud OTLP credentials for distributed tracing" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-east-2:855323747881:secret:myrunstreak/dev/grafana/otel-2DaeO1" -> null
      - name                           = "myrunstreak/dev/grafana/otel" -> null
      - recovery_window_in_days        = 0 -> null
      - tags                           = {
          - "Description" = "Grafana Cloud OTLP tracing credentials"
          - "Environment" = "dev"
          - "Name"        = "myrunstreak-grafana-otel"
          - "Project"     = "MyRunStreak"
        } -> null
      - tags_all                       = {
          - "Description" = "Grafana Cloud OTLP tracing credentials"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Name"        = "myrunstreak-grafana-otel"
          - "Project"     = "MyRunStreak"
        } -> null
        # (3 unchanged attributes hidden)
    }

  # module.secrets.aws_secretsmanager_secret_version.grafana_otel[0] will be destroyed
  # (because aws_secretsmanager_secret_version.grafana_otel is not in configuration)
  - resource "aws_secretsmanager_secret_version" "grafana_otel" {
      - arn              = "arn:aws:secretsmanager:us-east-2:855323747881:secret:myrunstreak/dev/grafana/otel-2DaeO1" -> null
      - id               = "arn:aws:secretsmanager:us-east-2:855323747881:secret:myrunstreak/dev/grafana/otel-2DaeO1|terraform-20251126230658623600000002" -> null
      - secret_id        = "arn:aws:secretsmanager:us-east-2:855323747881:secret:myrunstreak/dev/grafana/otel-2DaeO1" -> null
      - secret_string    = (sensitive value) -> null
      - secret_string_wo = (write-only attribute) -> null
      - version_id       = "terraform-20251126230658623600000002" -> null
      - version_stages   = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

Plan: 36 to add, 3 to change, 57 to destroy.

Changes to Outputs:
  ~ api_gateway_url                   = (sensitive value)
  ~ api_health_endpoint               = (sensitive value)
  - api_key_value                     = (sensitive value) -> null
  + api_runs_endpoint                 = (sensitive value)
  + api_stats_endpoint                = (sensitive value)
  ~ api_sync_endpoint                 = (sensitive value)
  ~ deployment_instructions           = (sensitive value)

```

</details>

*Pusher: @silverbeer, Action: `pull_request`, Working Directory: `terraform/environments/dev`, Workflow: `Terraform Plan`*